OpenFOAM-v1712/tutorials/heatTransfer/buoyantPimpleFoam/hotRoom/Allrun
#!/bin/sh
cd ${0%/*} || exit 1                        # Run from this directory
. $WM_PROJECT_DIR/bin/tools/RunFunctions    # Tutorial run functions

runApplication blockMesh

restore0Dir

runApplication setFields
runApplication $(getApplication)

#------------------------------------------------------------------------------
